In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('C:\\Users\\akash\\Desktop\\Iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

# understanding_analysing the data Set
Methods
here v stands for variable
v.head(), v.tail(), v.info(), v.describe(), v.corr()
v.isnull().sum(), v.notnull().sum(), v.count()
v['column_name'].value_counts().sort_value()
v['column_name'].unique()
v['column_name'].nunique()
v.sample(no.)

Attributes

v.size
v.shape
v.columns
v.ndim

In [3]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [4]:
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [6]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [7]:
df.corr()

C:\Windows\Temp\ipykernel_11212\1886530979.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Id,1.000000,0.716676,-0.397729,0.882747,0.899759
SepalLengthCm,0.716676,1.000000,-0.109369,0.871754,0.817954
SepalWidthCm,-0.397729,-0.109369,1.000000,-0.420516,-0.356544
PetalLengthCm,0.882747,0.871754,-0.420516,1.000000,0.962757
PetalWidthCm,0.899759,0.817954,-0.356544,0.962757,1.000000

In [8]:
df.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [9]:
df.count()

Id               150
SepalLengthCm    150
SepalWidthCm     150
PetalLengthCm    150
PetalWidthCm     150
Species          150
dtype: int64

In [10]:
df['Species'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

In [11]:
df['Species'].value_counts().sort_values()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

In [12]:
df['Species'].sort_values()

0         Iris-setosa
27        Iris-setosa
28        Iris-setosa
29        Iris-setosa
30        Iris-setosa
            ...
119    Iris-virginica
120    Iris-virginica
121    Iris-virginica
111    Iris-virginica
149    Iris-virginica
Name: Species, Length: 150, dtype: object

In [13]:
df['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [14]:
df['Species'].nunique()

3

In [15]:
df.sample(7) # randomly provide values

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
115,116,6.4,3.2,5.3,2.3,Iris-virginica
7,8,5.0,3.4,1.5,0.2,Iris-setosa
123,124,6.3,2.7,4.9,1.8,Iris-virginica
137,138,6.4,3.1,5.5,1.8,Iris-virginica
49,50,5.0,3.3,1.4,0.2,Iris-setosa
75,76,6.6,3.0,4.4,1.4,Iris-versicolor
62,63,6.0,2.2,4.0,1.0,Iris-versicolor

In [16]:
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [17]:
df.dtypes

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [18]:
df.shape,df.size,type(df)

((150, 6), 900, pandas.core.frame.DataFrame)

In [19]:
# creat series from list
import pandas as pd
l=[1,2,3,4]
s=pd.Series(l,index=('a','b','c','d'),dtype='float')
s,type(s),s.shape,s.size

(a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64,
 pandas.core.series.Series,
 (4,),
 4)

In [20]:
# statastical operations with Series
s.mean(),s.mode(),s.median()

(2.5,
 0    1.0
 1    2.0
 2    3.0
 3    4.0
 dtype: float64,
 2.5)

In [21]:
# create csv from series   
s.to_csv('series_first.csv',index=False)

In [22]:
a=[1,2,3,4,5]            # create Series from list
a
import pandas as pd
a=pd.Series(a,index=('a','b','c','d','e'),dtype='str')
a,type(a)

(a    1
 b    2
 c    3
 d    4
 e    5
 dtype: object,
 pandas.core.series.Series)

In [23]:
# create series form dict
s_d={'a':1,'b':2,'c':3}
s_d=pd.Series(s_d)
s_d

a    1
b    2
c    3
dtype: int64

In [24]:
# create a series from tuple
s_t=(1,2,3,4,5)
pd.Series(s_t)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
l=[['Akash',100,'Sasaram'],        # Create from list
   ['Kumar',98,'Patna'],
   ['Gupta',99,'Bhopal']]
d_l=pd.DataFrame(l,columns=('name','marks','place'),index=('r1','r2','r3'))
d_l

     name  marks    place
r1  Akash    100  Sasaram
r2  Kumar     98    Patna
r3  Gupta     99   Bhopal

In [26]:
d=pd.DataFrame({'Name':['Akash','Kumar','Gupta'],
               'Marks':[100,98,99]
               })
d

    Name  Marks
0  Akash    100
1  Kumar     98
2  Gupta     99

In [27]:
# creating Dataframe from dictionary
d={'name':['Akash','Kumar','Gupta'],'Marks':[10,20,30]}
d=pd.DataFrame(d)
d

    name  Marks
0  Akash     10
1  Kumar     20
2  Gupta     30

# create csv file from dataframe
v.to_csv('file_name.csv',index=False)

In [28]:
# create csv file from dataframe
d.to_csv('DataFrame_first.csv',index=False)

In [29]:
d=pd.read_csv('DataFrame_first.csv')
d

    name  Marks
0  Akash     10
1  Kumar     20
2  Gupta     30

In [30]:
d['name']                  # extract columns as Series

0    Akash
1    Kumar
2    Gupta
Name: name, dtype: object

In [31]:
d['Marks']

0    10
1    20
2    30
Name: Marks, dtype: int64

In [32]:
e_a=d['name']
e_a

0    Akash
1    Kumar
2    Gupta
Name: name, dtype: object

In [33]:
# if you use duble square Bracket then it will become dic

In [34]:
#e_a[['name']]
w=[[e_a]] # it will become list
type(w)

list

In [35]:
d[['name']]

    name
0  Akash
1  Kumar
2  Gupta

In [36]:
# extracting Series from DataFrame -
s=pd.Series(d['name'])
s1=d['name']
s,s1

(0    Akash
 1    Kumar
 2    Gupta
 Name: name, dtype: object,
 0    Akash
 1    Kumar
 2    Gupta
 Name: name, dtype: object)

# Casting in a list & numpy
v.tolist() # sheries case
v.index.tolist()
v.values.tolist())
v.columns.tolist()
v.values as attribute convert array
v.to_numpy()

In [37]:
# most Importent  in matplotlinb and seaborn
# value, index & columns
v_s=s.values   # casting in array
i_s=s.index
c_d=d.columns
v_s,i_s,c_d

(array(['Akash', 'Kumar', 'Gupta'], dtype=object),
 RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'Marks'], dtype='object'))

In [38]:
pd.DataFrame(v_s)

       0
0  Akash
1  Kumar
2  Gupta

In [39]:
# convert value and index into list
s_v_l=s.values.tolist()  # array then list - v.values.tolist()
s_i_l=s.index.tolist()
s_v_l,s_i_l

(['Akash', 'Kumar', 'Gupta'], [0, 1, 2])

# Use numpys to create DataFrame

In [40]:
import numpy as np
import random
arr=np.random.rand(10).reshape(2,5)
pd.DataFrame(arr)

          0         1         2         3        4
0  0.627904  0.163257  0.797436  0.618503  0.12148
1  0.680854  0.639978  0.993698  0.072210  0.70253

In [41]:
# extracting elements from series  through indexing 
s[2],s[0],s[1]

('Gupta', 'Akash', 'Kumar')

In [42]:
# extracting elements from dictionary through slicing
s[:2],s[-5:-1]

(0    Akash
 1    Kumar
 Name: name, dtype: object,
 0    Akash
 1    Kumar
 Name: name, dtype: object)

In [43]:
s=pd.Series([1,2,3,4,4,6,5])
s.mean(),s.mode(),s.median(),s.count(),s.cumsum(),s.cumprod() # cumulative sum & product

(3.5714285714285716,
 0    4
 dtype: int64,
 4.0,
 7,
 0     1
 1     3
 2     6
 3    10
 4    14
 5    20
 6    25
 dtype: int64,
 0       1
 1       2
 2       6
 3      24
 4      96
 5     576
 6    2880
 dtype: int64)

# DataFrame - most importent creating dataframe from Series & add Series

In [44]:
# DataFrame - most importent creating dataframe from Series
l=[1,2,3,4,5]
l2=['a','b','c','d','e']
s=pd.Series(l)
s1=pd.Series(l2)
s,s1

(0    1
 1    2
 2    3
 3    4
 4    5
 dtype: int64,
 0    a
 1    b
 2    c
 3    d
 4    e
 dtype: object)

In [45]:
d_s=pd.DataFrame({'int':s,'str':s1})
d_s

   int str
0    1   a
1    2   b
2    3   c
3    4   d
4    5   e

In [46]:
d_s.shape

(5, 2)

In [47]:
# adding sering in dataframe
l='A','B','C','D','E'
s_a_d=pd.Series(l)
s_a_d,s_a_d.shape

(0    A
 1    B
 2    C
 3    D
 4    E
 dtype: object,
 (5,))

In [48]:
d_s_a=d_s['U_str']=s_a_d   # v[key(given_name)]=value(series as value)
d_s_a # here single value assign to multiple variable

0    A
1    B
2    C
3    D
4    E
dtype: object

In [49]:
l=[1.1,1.2,1.3,1.4,1.5]
f_s=pd.Series(l)
d_s['float']=f_s    # variable['key'(a key give name)]=value(pass Series)

In [50]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

# set_index() - this function for set_index
allow to assign a column name as a index of a dataframe

In [51]:
d_s.set_index('float')

       int str U_str
float
1.1      1   a     A
1.2      2   b     B
1.3      3   c     C
1.4      4   d     D
1.5      5   e     E

# sort_index()

# sort_values()
list items
list items

In [52]:
d_l.sort_index(ascending=False)

     name  marks    place
r3  Gupta     99   Bhopal
r2  Kumar     98    Patna
r1  Akash    100  Sasaram

In [53]:
d_l.sort_index(axis=1) # OR to print column names in reverse alphabetical order 
# v.sort_index(axis=1,ascending=False)

    marks   name    place
r1    100  Akash  Sasaram
r2     98  Kumar    Patna
r3     99  Gupta   Bhopal

In [54]:
d_l.sort_index(axis=0,ascending=False) # alphabetical order

     name  marks    place
r3  Gupta     99   Bhopal
r2  Kumar     98    Patna
r1  Akash    100  Sasaram

In [55]:
d_l.sort_index(axis=0)

     name  marks    place
r1  Akash    100  Sasaram
r2  Kumar     98    Patna
r3  Gupta     99   Bhopal

In [56]:
#v.sort_value(by='col', ascending=fasle)  # colums wise asceding true or false

In [57]:
d=pd.Series([33,32,31],index=('r1','r2','r3'))
d_l['ages']=d
d_l

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [58]:
d_l.sort_values(by='place', ascending=False)

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [59]:
d_l.sort_values(by=['ages','marks'],ascending=False)

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [60]:
# access columns values in series
# method  1 in Seies
d_s['str']

0    a
1    b
2    c
3    d
4    e
Name: str, dtype: object

In [61]:
# method 2 in Series
d_s.str

0    a
1    b
2    c
3    d
4    e
Name: str, dtype: object

# Accessing one/multiple colums in DataFrame
v['col_1'] extract as Series(single square brecket)

v[['col_1']]extract as Data Frame (duble squre brecket)

v[['col_1,col_2,col_n']]

v.loc[[r_index_no1,r_index_no2],[col_names]]

v.loc[ slicing :,[col_names]]

v.loc[[row_no./names], slicing : ]

v.loc[ :,:]

v.iloc[ 1:2 (sliceing),[cl_index_n1,cl_index_n2]]

v.iloc[[1,2],[0]]

v.iloc[[r1,r3(row_indexing)],[c0,c4(column_indexing)]]

v.iloc[:,:]

v.iloc[start:end:step(row),start:end:step(columns)]

v.dorp() - drop(['row_no./col_name'],axis=0(by defalt row)/1(column))

inplace=True - in any func means permanent change in present col.

v.drop_duplicates()

In [62]:
# accessing multiple colums values in DataFrame
# method 1
d_s[['str','U_str']]      # use double squre Brecket

  str U_str
0   a     A
1   b     B
2   c     C
3   d     D
4   e     E

In [63]:
# loc function in row can indexing  and slicing but column write a column name
# method - 2 with loc function
d_s.loc[[1,2,4,1],['str','int']]  # v.loc[[1,3,4(random_indexing)],['cl_name1','cl_name2']]

  str  int
1   b    2
2   c    3
4   e    5
1   b    2

In [64]:
# loc function in row can indexing  and slicing but column write a column name
# method - 3  with loc function
d_s.loc[1:2,['int']] # v.loc[ 2:30 (slicing),['cl_name1,cl_name2']

   int
1    2
2    3

In [65]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [66]:
d_s.loc[:,['float']]

   float
0    1.1
1    1.2
2    1.3
3    1.4
4    1.5

In [67]:
import numpy as np                             
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
a[[1,2,0,2,1],[0,1,1,2,1]]

array([4, 8, 2, 9, 5])

In [68]:
# method -1 in v.iloc[]
# v.iloc[ 1:2 (sliceing),[cl_index_n1,cl_index_n2]]

In [69]:
d_s.iloc[1:,[0,3]]      # index no. use for columns

   int  float
1    2    1.2
2    3    1.3
3    4    1.4
4    5    1.5

In [70]:
d_s.iloc[[1,2],[0]]    # v.iloc[[r1,r3(row_indexing)],[c0,c4(column_indexing)]]

   int
1    2
2    3

In [71]:
d_s.iloc[:,:]           # v.iloc[start:end:step(row),start:end:step(columns)]

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [72]:
df.loc[[10,130,80],['PetalLengthCm']]    # with indexing

     PetalLengthCm
10             1.5
130            6.1
80             3.8

In [73]:
df.loc[:,['SepalLengthCm','PetalLengthCm']].head(2)

   SepalLengthCm  PetalLengthCm
0            5.1            1.4
1            4.9            1.4

In [74]:
df.loc[(df['SepalWidthCm']>4)&(df['SepalLengthCm']>5)&(df['Species']=='Iris-setosa')]

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
15  16            5.7           4.4            1.5           0.4  Iris-setosa
32  33            5.2           4.1            1.5           0.1  Iris-setosa
33  34            5.5           4.2            1.4           0.2  Iris-setosa

In [75]:
df.iloc[[1,125,93],[1,2,3,4,5]] # with indexing

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm          Species
1              4.9           3.0            1.4           0.2      Iris-setosa
125            7.2           3.2            6.0           1.8   Iris-virginica
93             5.0           2.3            3.3           1.0  Iris-versicolor

In [76]:
df.iloc[3:10,1:]

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
3            4.6           3.1            1.5           0.2  Iris-setosa
4            5.0           3.6            1.4           0.2  Iris-setosa
5            5.4           3.9            1.7           0.4  Iris-setosa
6            4.6           3.4            1.4           0.3  Iris-setosa
7            5.0           3.4            1.5           0.2  Iris-setosa
8            4.4           2.9            1.4           0.2  Iris-setosa
9            4.9           3.1            1.5           0.1  Iris-setosa

# Filtter DataFrame
query
v.query( 'col_name < No.' )
complax queries

In [77]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [78]:
d_s.query('int > 4') # extract quanitative values

   int str U_str  float
4    5   e     E    1.5

In [79]:
d_s.query('int > 4') # extract quanitative values

   int str U_str  float
4    5   e     E    1.5

In [80]:
d_s[['int','str','float']].query('int<6 & float>1.1')

   int str  float
1    2   b    1.2
2    3   c    1.3
3    4   d    1.4
4    5   e    1.5

In [81]:
d_s[['int','str','float']].query('int<6 and float>1.1')

   int str  float
1    2   b    1.2
2    3   c    1.3
3    4   d    1.4
4    5   e    1.5

In [82]:
d_s[['int','str','float']][(d_s['int']<6) & (d_s['float']>1.1)]

   int str  float
1    2   b    1.2
2    3   c    1.3
3    4   d    1.4
4    5   e    1.5

In [83]:
#d_s[['int','str','float']][(d_s['int']<6) and (d_s['float']>1.1)]

In [84]:
d_s.query('str=="c"')

   int str U_str  float
2    3   c     C    1.3

In [85]:
d_s.query('int==3')

   int str U_str  float
2    3   c     C    1.3

In [86]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [87]:
d_s[['int','str']][d_s['float']<1.9]

   int str
0    1   a
1    2   b
2    3   c
3    4   d
4    5   e

In [88]:
d_l[['name','marks']][d_l['marks']>98]

     name  marks
r1  Akash    100
r3  Gupta     99

In [89]:
d_l[['name','marks']].query('marks>98')

     name  marks
r1  Akash    100
r3  Gupta     99

In [90]:
d_l[['name','marks']][d_l['marks']>97].sum()

name     AkashKumarGupta
marks                297
dtype: object

In [91]:
d_l[['name','marks']].query('marks>90').sum()

name     AkashKumarGupta
marks                297
dtype: object

In [92]:
d_l[['marks','name']][d_l['marks']==100]

    marks   name
r1    100  Akash

In [93]:
d_l[['marks','name']].query('marks==100')

    marks   name
r1    100  Akash

In [94]:
l=[33,32,31] 
l_l=pd.Series(l,index=('r1','r2','r3'))
d_l['ages']=l_l
d_l

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [95]:
d_l.query('marks>=100 and ages<=33')

     name  marks    place  ages
r1  Akash    100  Sasaram    33

In [96]:
d_l.query('marks>=100 or ages<=33')

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [97]:
d_l.query('(marks>=100 and ages>=33) and name=="Akash"')

     name  marks    place  ages
r1  Akash    100  Sasaram    33

In [98]:
d_l.query('marks>=100 or ages<=33 or name=="Akash"')

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [99]:
d_l[(d_l['marks']>=100) | (d_l['ages']<=33) | (d_l['name']=='Akash')]

     name  marks    place  ages
r1  Akash    100  Sasaram    33
r2  Kumar     98    Patna    32
r3  Gupta     99   Bhopal    31

In [100]:
df.query('PetalLengthCm>1 and PetalWidthCm>0.3 and Species=="Iris-setosa"')

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
5    6            5.4           3.9            1.7           0.4  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa
21  22            5.1           3.7            1.5           0.4  Iris-setosa
23  24            5.1           3.3            1.7           0.5  Iris-setosa
26  27            5.0           3.4            1.6           0.4  Iris-setosa
31  32            5.4           3.4            1.5           0.4  Iris-setosa
43  44            5.0           3.5            1.6           0.6  Iris-setosa
44  45            5.1           3.8            1.9           0.4  Iris-setosa

In [101]:
df[(df['PetalLengthCm']>1) & (df['PetalWidthCm']>0.3) & (df['Species']=='Iris-setosa')]

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
5    6            5.4           3.9            1.7           0.4  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa
21  22            5.1           3.7            1.5           0.4  Iris-setosa
23  24            5.1           3.3            1.7           0.5  Iris-setosa
26  27            5.0           3.4            1.6           0.4  Iris-setosa
31  32            5.4           3.4            1.5           0.4  Iris-setosa
43  44            5.0           3.5            1.6           0.6  Iris-setosa
44  45            5.1           3.8            1.9           0.4  Iris-setosa

In [102]:
print(df['Species'].value_counts())
df_cq=df[df['Species']!='Iris-setosa'] 
print(df_cq['Species'].value_counts())

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

# Data Cleaning - Rename, Drop Columns, dropna, Fillna.ipynb
df.drop('R_no./name') by defalt is axis 0
df.drop('R_no./name',axis=0) - drop rows
df.drop('Col_no./name'axis=1) - drop column
copy

df.drop(['col_name'],axis=1,inplace=True)
df=df.drop(['B',"C"],axis=1)
df.columns=['one','Two','Three','four','five','six','seven','eight']
df.index=['a','b','c','d','e']

In [103]:
d_s.drop([1,2,3]) # drop row by indexing

   int str U_str  float
0    1   a     A    1.1
4    5   e     E    1.5

In [104]:
d_s.drop(['str','float','int'],axis=1)

  U_str
0     A
1     B
2     C
3     D
4     E

In [105]:
df.head(2)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa

In [106]:
df.drop(['SepalLengthCm','PetalLengthCm','PetalWidthCm'],axis=1).head()

   Id  SepalWidthCm      Species
0   1           3.5  Iris-setosa
1   2           3.0  Iris-setosa
2   3           3.2  Iris-setosa
3   4           3.1  Iris-setosa
4   5           3.6  Iris-setosa

In [107]:
df.drop([1,3,5]).head(5)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa

In [108]:
# rename columns with list
d_s.columns=list('isuf')
d_s

   i  s  u    f
0  1  a  A  1.1
1  2  b  B  1.2
2  3  c  C  1.3
3  4  d  D  1.4
4  5  e  E  1.5

In [109]:
d_s['f']=333  # add item in dataset as whole column
d_s.loc[0,'i']=123  # v.loc[row,'col']=value
d_s.loc[0,'s']=311
d_s
df['e']=100
df[20]=20
df.head()
df.loc[0,'201']=33
df.head()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species,e,20,201
0,1,5.1,3.5,1.4,0.2,Iris-setosa,100,20,33.0
1,2,4.9,3.0,1.4,0.2,Iris-setosa,100,20,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa,100,20,NaN
3,4,4.6,3.1,1.5,0.2,Iris-setosa,100,20,NaN
4,5,5.0,3.6,1.4,0.2,Iris-setosa,100,20,NaN

In [110]:
df.head(2)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species,e,20,201
0,1,5.1,3.5,1.4,0.2,Iris-setosa,100,20,33.0
1,2,4.9,3.0,1.4,0.2,Iris-setosa,100,20,NaN

In [111]:
df.columns

Index([           'Id', 'SepalLengthCm',  'SepalWidthCm', 'PetalLengthCm',
        'PetalWidthCm',       'Species',             'e',              20,
                 '201'],
      dtype='object')

In [112]:
df1=df.drop(['e',20,'201'],axis=1)
df1.head(2)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa

# Rename columns

In [113]:
# rename all columns
df1.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [114]:
df1.columns = ['id','sepallength','sepalwidth','petallength','petalwidth','species']
df1.head(1)

   id  sepallength  sepalwidth  petallength  petalwidth      species
0   1          5.1         3.5          1.4         0.2  Iris-setosa

In [115]:
# rename specific columns
df1.rename(columns={'sepallength':'sl','sepalwidth':'sw','petallength':'pl','petalwidth':'pw'},inplace=True)
df1.head(2)

   id   sl   sw   pl   pw      species
0   1  5.1  3.5  1.4  0.2  Iris-setosa
1   2  4.9  3.0  1.4  0.2  Iris-setosa

In [116]:
# rearrange columns 
# method = 1
col=['sw','pl','pw','id','sl','species']
df1=pd.DataFrame(df1,columns=col)
df1.head(1)

    sw   pl   pw  id   sl      species
0  3.5  1.4  0.2   1  5.1  Iris-setosa

In [117]:
# method -2
df1=df1[['id','sw','sl','pl','pw','species']]
df1.head(1)

   id   sw   sl   pl   pw      species
0   1  3.5  5.1  1.4  0.2  Iris-setosa

# drop the duplicate - df= drop_duplicate row

In [118]:
d_s[10]=20
d_s[10]=22
print(d_s.head(2))

     i    s  u    f  10
0  123  311  A  333  22
1    2    b  B  333  22

In [119]:
d_d=d_s.drop(['i','s','u','f'],axis=1)
d_d.head(2)

   10
0  22
1  22

In [120]:
d_d=d_d.drop_duplicates() # row wise
d_d

   10
0  22

In [121]:
d_s.drop_duplicates([10])  # drop value column_name wise

     i    s  u    f  10
0  123  311  A  333  22

In [122]:
d_s.columns

Index(['i', 's', 'u', 'f', 10], dtype='object')

In [123]:
d_s

     i    s  u    f  10
0  123  311  A  333  22
1    2    b  B  333  22
2    3    c  C  333  22
3    4    d  D  333  22
4    5    e  E  333  22

In [124]:
d_s.drop_duplicates([10])

     i    s  u    f  10
0  123  311  A  333  22

In [125]:
# delete -
import sys
del d_s[(10)]

In [126]:
df.loc[[10,20,135],["SepalLengthCm"]]

     SepalLengthCm
10             5.4
20             5.4
135            7.7

In [127]:
df.std()

C:\Windows\Temp\ipykernel_11212\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
e                 0.000000
20                0.000000
201                    NaN
dtype: float64

In [128]:
df.var()

C:\Windows\Temp\ipykernel_11212\1568254755.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.var()

Id               1887.500000
SepalLengthCm       0.685694
SepalWidthCm        0.188004
PetalLengthCm       3.113179
PetalWidthCm        0.582414
e                   0.000000
20                  0.000000
201                      NaN
dtype: float64

In [129]:
df.median()

C:\Windows\Temp\ipykernel_11212\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Id                75.50
SepalLengthCm      5.80
SepalWidthCm       3.00
PetalLengthCm      4.35
PetalWidthCm       1.30
e                100.00
20                20.00
201               33.00
dtype: float64

In [130]:
#rediction
df
d_l=df
d_l
d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()

C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()
C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()
C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()
C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()

(Id                75.500000
 SepalLengthCm      5.843333
 SepalWidthCm       3.054000
 PetalLengthCm      3.758667
 PetalWidthCm       1.198667
 e                100.000000
 20                20.000000
 201               33.000000
 dtype: float64,
 Id                75.50
 SepalLengthCm      5.80
 SepalWidthCm       3.00
 PetalLengthCm      4.35
 PetalWidthCm       1.30
 e                100.00
 20                20.00
 201               33.00
 dtype: float64,
 Id               43.445368
 SepalLengthCm     0.828066
 SepalWidthCm      0.433594
 PetalLengthCm     1.764420
 PetalWidthCm      0.763161
 e                 0.000000
 20                0.000000
 201                    NaN
 dtype: float64,
 Id               1887.500000
 SepalLengthCm       0.685694
 SepalWidthCm        0.188004
 PetalLengthCm       3.113179
 PetalWidthCm        0.582414
 e                   0.000000
 20                  0.000000
 201                      NaN
 dtype: float64)

In [131]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
Id,1,2,3,4,5,6,7,8,9,10,...,141,142,143,144,145,146,147,148,149,150
SepalLengthCm,5.1,4.9,4.7,4.6,5.0,5.4,4.6,5.0,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
SepalWidthCm,3.5,3.0,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3.0,2.5,3.0,3.4,3.0
PetalLengthCm,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5.0,5.2,5.4,5.1
PetalWidthCm,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2.0,2.3,1.8
Species,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,...,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica
e,100,100,100,100,100,100,100,100,100,100,...,100,100,100,100,100,100,100,100,100,100
20,20,20,20,20,20,20,20,20,20,20,...,20,20,20,20,20,20,20,20,20,20
201,33.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [133]:
d_s.fillna(method='bfill')

     i    s  u    f
0  123  311  A  333
1    2    b  B  333
2    3    c  C  333
3    4    d  D  333
4    5    e  E  333

In [134]:
d_s

     i    s  u    f
0  123  311  A  333
1    2    b  B  333
2    3    c  C  333
3    4    d  D  333
4    5    e  E  333

In [135]:
d_s['int']=[11,12,13,np.nan,15]
d_s

     i    s  u    f   int
0  123  311  A  333  11.0
1    2    b  B  333  12.0
2    3    c  C  333  13.0
3    4    d  D  333   NaN
4    5    e  E  333  15.0

In [136]:
m_1=d_s['int'].mean()
m_1

12.75

In [137]:
#fill_values = {'A': df['A'].mean(), 'B': 34, 'C': 2, 'D': 3}
fill={'int':m_1,100:2,'f':3,(3,'u'):2}
d_f=d_s.fillna(value=fill)
d_f

     i    s  u    f    int
0  123  311  A  333  11.00
1    2    b  B  333  12.00
2    3    c  C  333  13.00
3    4    d  D  333  12.75
4    5    e  E  333  15.00

In [138]:
d_f.columns

Index(['i', 's', 'u', 'f', 'int'], dtype='object')

In [139]:
d1=pd.DataFrame({'a':[1,2,4,6],
'B':[12,13,14,15],
'C':[111,222,333,444]},index=('R1','R2','R3','R4'))
d2=pd.DataFrame({'a':[1,4,6,7],
'b':[1.2,1.3,1.4,1.5],
'c':[100,200,300,400]},index=('r1','r2','r3','r4'))

In [140]:
d1

    a   B    C
R1  1  12  111
R2  2  13  222
R3  4  14  333
R4  6  15  444

In [141]:
d2

    a    b    c
r1  1  1.2  100
r2  4  1.3  200
r3  6  1.4  300
r4  7  1.5  400

In [142]:
d=pd.merge(d1,d2,on='a',how='inner')
d

   a   B    C    b    c
0  1  12  111  1.2  100
1  4  14  333  1.3  200
2  6  15  444  1.4  300

In [143]:
d=pd.merge(d1,d2,on='a',how='outer')
d

   a     B      C    b      c
0  1  12.0  111.0  1.2  100.0
1  2  13.0  222.0  NaN    NaN
2  4  14.0  333.0  1.3  200.0
3  6  15.0  444.0  1.4  300.0
4  7   NaN    NaN  1.5  400.0

In [144]:
d=pd.merge(d1,d2,on='a',how='left')
d

   a   B    C    b      c
0  1  12  111  1.2  100.0
1  2  13  222  NaN    NaN
2  4  14  333  1.3  200.0
3  6  15  444  1.4  300.0

In [145]:
d=pd.merge(d1,d2,on='a',how='right')
d

   a     B      C    b    c
0  1  12.0  111.0  1.2  100
1  4  14.0  333.0  1.3  200
2  6  15.0  444.0  1.4  300
3  7   NaN    NaN  1.5  400

In [146]:
d=d1.append(d2)
d

C:\Windows\Temp\ipykernel_11212\3458905419.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d=d1.append(d2)

    a     B      C    b      c
R1  1  12.0  111.0  NaN    NaN
R2  2  13.0  222.0  NaN    NaN
R3  4  14.0  333.0  NaN    NaN
R4  6  15.0  444.0  NaN    NaN
r1  1   NaN    NaN  1.2  100.0
r2  4   NaN    NaN  1.3  200.0
r3  6   NaN    NaN  1.4  300.0
r4  7   NaN    NaN  1.5  400.0

In [147]:
d=d2.append(d1)
d

C:\Windows\Temp\ipykernel_11212\3001151162.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d=d2.append(d1)

    a    b      c     B      C
r1  1  1.2  100.0   NaN    NaN
r2  4  1.3  200.0   NaN    NaN
r3  6  1.4  300.0   NaN    NaN
r4  7  1.5  400.0   NaN    NaN
R1  1  NaN    NaN  12.0  111.0
R2  2  NaN    NaN  13.0  222.0
R3  4  NaN    NaN  14.0  333.0
R4  6  NaN    NaN  15.0  444.0

In [148]:
d.columns
d.index=list(range(0,8))
d

   a    b      c     B      C
0  1  1.2  100.0   NaN    NaN
1  4  1.3  200.0   NaN    NaN
2  6  1.4  300.0   NaN    NaN
3  7  1.5  400.0   NaN    NaN
4  1  NaN    NaN  12.0  111.0
5  2  NaN    NaN  13.0  222.0
6  4  NaN    NaN  14.0  333.0
7  6  NaN    NaN  15.0  444.0

In [149]:
# concat
pd.concat([d1,d2])

    a     B      C    b      c
R1  1  12.0  111.0  NaN    NaN
R2  2  13.0  222.0  NaN    NaN
R3  4  14.0  333.0  NaN    NaN
R4  6  15.0  444.0  NaN    NaN
r1  1   NaN    NaN  1.2  100.0
r2  4   NaN    NaN  1.3  200.0
r3  6   NaN    NaN  1.4  300.0
r4  7   NaN    NaN  1.5  400.0

In [150]:
pd.concat([d2,d1],axis=1)

      a    b      c    a     B      C
r1  1.0  1.2  100.0  NaN   NaN    NaN
r2  4.0  1.3  200.0  NaN   NaN    NaN
r3  6.0  1.4  300.0  NaN   NaN    NaN
r4  7.0  1.5  400.0  NaN   NaN    NaN
R1  NaN  NaN    NaN  1.0  12.0  111.0
R2  NaN  NaN    NaN  2.0  13.0  222.0
R3  NaN  NaN    NaN  4.0  14.0  333.0
R4  NaN  NaN    NaN  6.0  15.0  444.0

# Transpose

In [151]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
Id,1,2,3,4,5,6,7,8,9,10,...,141,142,143,144,145,146,147,148,149,150
SepalLengthCm,5.1,4.9,4.7,4.6,5.0,5.4,4.6,5.0,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
SepalWidthCm,3.5,3.0,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3.0,2.5,3.0,3.4,3.0
PetalLengthCm,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5.0,5.2,5.4,5.1
PetalWidthCm,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2.0,2.3,1.8
Species,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,Iris-setosa,...,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica,Iris-virginica
e,100,100,100,100,100,100,100,100,100,100,...,100,100,100,100,100,100,100,100,100,100
20,20,20,20,20,20,20,20,20,20,20,...,20,20,20,20,20,20,20,20,20,20
201,33.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [152]:
#rediction
df
d_l=df
d_l
d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()

C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()
C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()
C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()
C:\Windows\Temp\ipykernel_11212\1306969315.py:5: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d_l.mean(),d_l.median(),d_l.std(),d_l.var() # ,d_l.mode()

(Id                75.500000
 SepalLengthCm      5.843333
 SepalWidthCm       3.054000
 PetalLengthCm      3.758667
 PetalWidthCm       1.198667
 e                100.000000
 20                20.000000
 201               33.000000
 dtype: float64,
 Id                75.50
 SepalLengthCm      5.80
 SepalWidthCm       3.00
 PetalLengthCm      4.35
 PetalWidthCm       1.30
 e                100.00
 20                20.00
 201               33.00
 dtype: float64,
 Id               43.445368
 SepalLengthCm     0.828066
 SepalWidthCm      0.433594
 PetalLengthCm     1.764420
 PetalWidthCm      0.763161
 e                 0.000000
 20                0.000000
 201                    NaN
 dtype: float64,
 Id               1887.500000
 SepalLengthCm       0.685694
 SepalWidthCm        0.188004
 PetalLengthCm       3.113179
 PetalWidthCm        0.582414
 e                   0.000000
 20                  0.000000
 201                      NaN
 dtype: float64)

# DataFrame statistical functions

In [153]:
df.mean()

C:\Windows\Temp\ipykernel_11212\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Id                75.500000
SepalLengthCm      5.843333
SepalWidthCm       3.054000
PetalLengthCm      3.758667
PetalWidthCm       1.198667
e                100.000000
20                20.000000
201               33.000000
dtype: float64

In [154]:
df.median()

C:\Windows\Temp\ipykernel_11212\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Id                75.50
SepalLengthCm      5.80
SepalWidthCm       3.00
PetalLengthCm      4.35
PetalWidthCm       1.30
e                100.00
20                20.00
201               33.00
dtype: float64

In [155]:
#df.mode()
df.std()

C:\Windows\Temp\ipykernel_11212\300518187.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
e                 0.000000
20                0.000000
201                    NaN
dtype: float64

In [156]:
df.var() #var() function that calculates the variance along all columns

C:\Windows\Temp\ipykernel_11212\268666837.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.var() #var() function that calculates the variance along all columns

Id               1887.500000
SepalLengthCm       0.685694
SepalWidthCm        0.188004
PetalLengthCm       3.113179
PetalWidthCm        0.582414
e                   0.000000
20                  0.000000
201                      NaN
dtype: float64

In [157]:
df.dropna()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species,e,20,201
0,1,5.1,3.5,1.4,0.2,Iris-setosa,100,20,33.0

# Akash Kumar
Truba College Of Science & Technology
Enrollment No. 0533CL211001